scratch/tmp/pytest-of-Micha/pytest-0/test_external_mode_keeps_the_w0/external/0/p
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object p;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
inlet { type zeroGradient; }
outlet { type fixedValue; value uniform 0.0; }
front { type freestreamPressure; freestreamValue uniform 0.0; value uniform 0.0; }
back { type freestreamPressure; freestreamValue uniform 0.0; value uniform 0.0; }
ground { type freestreamPressure; freestreamValue uniform 0.0; value uniform 0.0; }
top { type freestreamPressure; freestreamValue uniform 0.0; value uniform 0.0; }
surface_0 { type zeroGradient; }
surface_1 { type zeroGradient; }
surface_2 { type zeroGradient; }
surface_3 { type zeroGradient; }
surface_4 { type zeroGradient; }
surface_5 { type zeroGradient; }
}
